Enterprise_Serivces/Cert/Bronze3/CSLGameLibraryService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/gamelibrary/contracts/2010/05/IGameLibraryService/UpdateGameLibraryItems</wsa:Action><wsa:MessageID>uuid:6290069a-ab43-4be4-8be7-c77bd9069e0a</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslgamelibraryserviceqa1.testgs.pvt/GameLibraryService.svc</wsa:To></soap:Header><soap:Body><UpdateGameLibraryItems xmlns="http://www.gamestop.com/services/csl/gamelibrary/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CustomerID xmlns="http://www.gamestop.com/services/csl/gamelibrary/messages/2010/05">1</CustomerID><Updates xmlns="http://www.gamestop.com/services/csl/gamelibrary/messages/2010/05"><GameLibraryItemUpdate xmlns="http://www.gamestop.com/services/core/entities/2010/05"><Action>Add</Action><Item><List>WishToOwn</List><ProductID>1</ProductID><SKU>999999</SKU><Title>test</Title></Item></GameLibraryItemUpdate></Updates></request></UpdateGameLibraryItems></soap:Body></soap:Envelope>